/*
 * * 계좌관리 프로그램
 * 다음 주어진 프로그램을 구현하시오.
 * <입력 및 출력형식>
 * ==== Banking System ====
 * 1.계좌등록
 * 2.입금처리
 * 3.출금처리
 * 4.전체고객 잔액보기
 * 5.프로그램 종료
 * =========================
 * 선택 =
 *
 * ==== 계좌등록 ====
 * 계좌번호 =
 * 고객이름 = xxx
 * 예금금액 =
 * xxx님 계좌가 등록되었습니다.
 *
 * ==== 입금처리 ====
 * 계좌번호 =
 * 입금금액 =
 * xxx님 현재잔액은 xxx원입니다.
 *
 * ==== 출금처리 ====
 * 계좌번호 =
 * 출금금액 =
 * xxx님 현재잔액은 xxx원입니다.
 *
 * ==== 전체고객 잔액보기 ====
 * 계좌번호 : xx, 고객이름 : xx, 예금잔액 : xxx
 *
 * <처리조건>
 * 1.계좌를 관리하기 위한 클래스 Account를 구현하시오.
 * 2.입금 및 출금처리시 고객의 계좌번호를 입력받은 후 해당 고객의 계좌가 있을 경우만 입출금이 진행되도록
 * 구현한다. 단, 계좌번호가 없을 경우 "입력하신 계좌번호가 존재하지않습니다."라는 메시지를 출력시킨다.
 * 3.주어진 입출력 형식에 맞게 프로그램이 동작되도록 구현한다.
 * 4.둘 이상의 고객을 관리할 목적으로 객체배열을 이용하여 구현한다.
 * 5.실제 처리를 담당하는 클래스 Service를 이용하여 처리를 구현한다.
 */
package banking;

public class Note {
	
}
