/*
 * 성적 관리 프로그램
 * 
 * <메뉴화면>
 * ==== Grade Menu ====
 * 1. 국어
 * 2. 수학
 * 3. 영어
 * 4. 총점
 * 5. 평균
 * 6. 학점
 * 7. 작업종료
 * ===================
 * 선택 =
 * 
 * <국어, 수학, 영어 선택시>
 * ## 점수 =
 * ## 성적 입력 완료!
 * 
 * <총점 선택시>
 * 성적 합계는 xxx점 입니다.
 * (국어, 수학, 영어) 성적을 입력해주세요.
 * => 입력하지 않은 과목을 표기한다.
 * 
 * <평균 선택시>
 * 성적 평균은 xx.xx점 입니다.
 * (국어, 수학, 영어) 성적을 입력해주세요.
 * => 입력하지 않은 과목을 표기한다.
 * 
 * <학점 선택시>
 * 학점은 x입니다.
 * (국어, 수학, 영어) 성적을 입력해주세요.
 * => 입력하지 않은 과목을 표기한다.
 * 
 * 학점 범위
 * 95점 이상 A+
 * 90점 이상 A
 * 85점 이상 B+
 * 80점 이상 B
 * 75점 이상 C+
 * 70점 이상 C
 * 65점 이상 D+
 * 60점 이상 D
 * 59점 이하 F
 * 
 * <처리 조건>
 * 1. 국어, 수학, 영어 성적을 입력받을시 0~100점 사이의 값이 아닌경우 다시 입력받는다.
 * 2. 평균은 소숫점 두번째자리까지 표현한다.
 * 3. 메뉴에서 작업종료를 입력하기 전까지는 메뉴를 계속 반복하여 출력한다.
 * 
 * 
 * */
public class Program_07 {

}
