package employee;
/*
 * 직원 관리 프로그램
 * 
 * 직원(Employee)
 *   - 정규직(Permanent) : 이름, 급여(기본급)
 *   - 영업직(Sales) : 이름, 급여(기본급 + 인센티브(판매실적 * 보너스율))
 *   - 계약직(PartTime) : 이름, 급여(시간당급여 * 근무시간)
 *   
 * 다음 주어진 프로그램을 구현하시오.
 * <입력 및 출력형식>
 * ==== Employee System ====
 * 1. 직원 등록
 * 2. 직원 조회
 * 3. 직원 수정
 * 4. 직원 삭제
 * 5. 프로그램 종료
 * =========================
 * 선택 = 
 * 
 * <직원 등록>
 * 고용 형태(1.정규직 / 2.영업직 / 3.알바) = 
 * 이름 = 
 * 
 * [정규직 선택시]
 * 기본급 = 
 * 
 * [영업직 선택시]
 * 기본급 = 
 * 판매실적 = 
 * 보너스율 = 
 * 
 * [알바 선택시]
 * 시급 = 
 * 근무시간 = 
 * 
 * <직원 조회>
 * 1. 개요
 * 2. 전체 조회
 * 3. 특정 직원조회
 * 선택 = 
 * 
 * [1. 개요]
 * 직원수 = 5명
 * 정규직 = 2명
 * 영업직 = 2명
 * 알바 = 1명
 * 전체 직원 급여 = xxx
 * 
 * [2. 전체 조회]
 * 사번	이름	고용형태	급여
 * 1.	홍길동	정규직		기본급
 * 2.	이순신	영업직		기본급+인센티브(판매실적*보너스율)
 * 3.	강감찬	알바		시간당급여+근무시간
 * 
 * [3. 특정 직원 조회]
 * 사번 = 
 * 이름 = 홍길동
 * 고용형태 = 정규직
 * 기본급 = 1600000
 * ...
 * 
 * <직원 수정>
 * 사번 = 
 * 고용 형태(1.정규직 / 2.영업직 / 3.알바) = 
 * 이름 = 
 * 
 * [정규직 선택시]
 * 기본급 = 
 * 
 * [영업직 선택시]
 * 기본급 = 
 * 판매실적 = 
 * 보너스율 = 
 * 
 * [알바 선택시]
 * 시급 = 
 * 근무시간 = 
 * 
 * <직원 삭제>
 * 사번 = 
 * 
 * */
public class Note {

}
