/*
 * Collection Framework
 * 
 * 자바 자료구조에서 배열만으로는 자료를 저장하는데 한계가 있다.
 * -> 정해진 자료 구조의 크기 -> 가변적이지 않다.
 * 
 * 이러한 한계를 극복하기 위해 자바에서는 Collection Framework라는 클래스를 제공한다.
 * (사전에 구현해놓은 자료구조 형태)
 * 
 * ArrayList
 *  - List의 구현체(자식)
 *  - 가변 배열
 *  - index로 접근할 수 있다.
 * HashMap
 *  - Map의 구현체(자식)
 *  - key-value의 한쌍으로 이루어져 있으며 key로 접근하여 value를 가져올 수 있다.
 *  - Key는 중복될 수 없다.
 *  - value는 중복 가능
 * HashSet
 *  - Set의 구현체(자식)
 *  - 중복을 허용하지 않는 List
 *  
 * 제네릭
 * 자바는 구체적인 자료형을 선언해야 한다.
 * 배열에서는 인스턴스 앞에 자료형을 붙여야한다.
 * Collection Framework에서는 제네릭을 붙여서 타입을 명확히 하거나 추론할 수 있게끔 선언하여 사용할 수 있다.
 * 자바의 8대자료형은 자료형 자체로 선언할 수 없다. => 래핑클래스를 사용해라!
 * 
 * */
public class Exam_01 {

}
