package grade;
/*
 * 성적 처리 프로그램
 * 다음 주어진 프로그램을 구현하시오.
 * 
 * <입력 및 출력형식>
 * ==== Student System ====
 * 1. 학생 등록
 * 2. 전체 성적 조회
 * 3. 프로그램 종료
 * ========================
 * 선택 = 
 * 
 * ==== 학생 등록 ====
 * 이름 = 홍길동
 * 국어 = 80
 * 영어 = 60
 * 수학 = 70
 * 
 * ==== 전체 성적 조회 ====
 * 학번 이름	국어	영어	수학	총점	평균
 * 1.	홍길동	80		60		70		210		70.00
 * 
 * <처리조건>
 * 1. 학생을 관리하기 위한 클래스 Student를 구현하시오.
 * 2. 학생 등록시 성적을 입력받되 0~100 사이의 수를 사용자가 입력하지 않은 경우 해당과목 입력을 다시 받는다.
 * 3. 평균은 소숫점 이하 둘째자리까지 표현할것.
 * 4. 주어진 입출력 형식에 맞게 프로그램이 동작되도록 구현한다.
 * 5. 둘 이상의 학생을 관리할 목적으로 객체배열을 이용하여 구현한다.
 * 6. 실제 처리를 담당하는 클래스 Service를 이용하여 처리를 구현한다.
 * 
 * */
public class Note {

}
